
# State **`s3://infrahouse-aws-control-990466748045/terraform.tfstate`**
## Affected resources counts

|  Success  |   🟢 Add |    Change |    Destroy |
|:---------:|--------:|----------:|-----------:|
|     ✅     |       5 |         0 |          0 |
## Affected resources by action

|  Action  | Resources                                                      |
|:--------:|:---------------------------------------------------------------|
|    🟢     | `aws_glacier_vault.synology`                                   |
|    🟢     | `aws_iam_access_key.synology`                                  |
|    🟢     | `aws_iam_policy.synology`                                      |
|    🟢     | `aws_iam_user.synology`                                        |
|    🟢     | `aws_iam_user_policy_attachment.synology`                      |
|    🟢     | `data.aws_iam_policy_document.ih-tf-terraform-control-assume:` |
<details>
<summary>STDOUT</summary>

```[command]/home/runner/work/_temp/c62e0214-2d27-4095-9ed8-7d76ca7dffa2/terraform-bin plan -no-color -var-file=configuration.tfvars --out=tf.plan
data.aws_iam_policy_document.ih-tf-terraform-control-assume: Reading...
data.aws_iam_policy_document.synology-permissions: Reading...
data.aws_iam_policy_document.synology-permissions: Read complete after 0s [id=1367345401]
data.aws_iam_policy_document.ih-tf-terraform-control-assume: Read complete after 0s [id=1268673852]
module.ih-tf-aws-control-990466748045-admin.data.aws_iam_policy_document.github-permissions: Reading...
data.aws_iam_policy_document.allow-assume: Reading...
aws_iam_user.aleks: Refreshing state... [id=aleks]
module.github-connector.aws_iam_openid_connect_provider.github: Refreshing state... [id=arn:aws:iam::990466748045:oidc-provider/token.actions.githubusercontent.com]
aws_iam_role.ih-tf-terraform-control: Refreshing state... [id=ih-tf-terraform-control]
data.aws_ssoadmin_instances.sso: Reading...
module.ih-tf-aws-control-990466748045-admin.data.aws_iam_policy.admin: Reading...
data.aws_iam_policy.administrator-access: Reading...
data.aws_iam_policy_document.allow-assume: Read complete after 0s [id=2219106455]
module.mediapc.aws_s3_bucket.dst: Refreshing state... [id=twindb20230824154451928300000001]
module.ih-tf-aws-control-990466748045-admin.data.aws_iam_policy_document.github-permissions: Read complete after 0s [id=2054866892]
aws_iam_policy.allow-assume: Refreshing state... [id=arn:aws:iam::990466748045:policy/allow-assume]
module.ih-tf-aws-control-990466748045-admin.aws_iam_policy.github: Refreshing state... [id=arn:aws:iam::990466748045:policy/ih-tf-aws-control-github]
aws_iam_access_key.aleks: Refreshing state... [id=AKIA6NHDLF2G665VS5V2]
data.aws_iam_policy_document.aws-admin: Reading...
data.aws_iam_policy_document.aws-admin: Read complete after 0s [id=2092112735]
aws_iam_role.aws-admin: Refreshing state... [id=aws-admin]
module.ih-tf-aws-control-990466748045-admin.data.aws_iam_policy_document.github-assume: Reading...
module.ih-tf-aws-control-990466748045-admin.data.aws_iam_policy_document.github-assume: Read complete after 0s [id=1250416815]
module.ih-tf-aws-control-990466748045-admin.aws_iam_role.github: Refreshing state... [id=ih-tf-aws-control-github]
aws_iam_user_policy_attachment.aleks: Refreshing state... [id=aleks-20230630022352782000000001]
module.ih-tf-aws-control-990466748045-admin.aws_iam_role_policy_attachment.github: Refreshing state... [id=ih-tf-aws-control-github-20230824154108908400000001]
module.ih-tf-aws-control-990466748045-admin.data.aws_iam_policy_document.admin-assume: Reading...
module.ih-tf-aws-control-990466748045-admin.data.aws_iam_policy_document.admin-assume: Read complete after 0s [id=2670099516]
module.ih-tf-aws-control-990466748045-admin.aws_iam_role.admin: Refreshing state... [id=ih-tf-aws-control-admin]
data.aws_ssoadmin_instances.sso: Read complete after 1s [id=us-west-1]
aws_identitystore_user.aleks: Refreshing state... [id=d-916728b3e5/59a9295e-9021-702e-3f16-b9203b8d24cb]
aws_identitystore_group.sso["AWSServiceCatalogAdmins"]: Refreshing state... [id=d-916728b3e5/a9a9595e-1051-70b4-b59e-c82d77841047]
aws_identitystore_group.sso["AWSSecurityAuditors"]: Refreshing state... [id=d-916728b3e5/59f9497e-40a1-706f-2efa-43c3bd99fe12]
aws_identitystore_group.sso["AWSSecurityAuditPowerUsers"]: Refreshing state... [id=d-916728b3e5/d969896e-6031-7076-4a7b-c8da8ce9f404]
aws_identitystore_group.sso["AWSLogArchiveAdmins"]: Refreshing state... [id=d-916728b3e5/99e9691e-5081-7090-4fd7-fd5d80fe35f7]
aws_identitystore_group.sso["AWSAccountFactory"]: Refreshing state... [id=d-916728b3e5/796959de-c011-7004-b753-de0a36ae352a]
aws_identitystore_group.sso["AWSLogArchiveViewers"]: Refreshing state... [id=d-916728b3e5/e9a9399e-6081-70c1-f9d8-46f3143f9c5f]
aws_identitystore_group.sso["AWSAuditAccountAdmins"]: Refreshing state... [id=d-916728b3e5/799999ee-e091-70a8-2c24-17f96ce95294]
aws_identitystore_group.sso["AWSControlTowerAdmins"]: Refreshing state... [id=d-916728b3e5/f909599e-a011-70e6-4194-b9643e0b5439]
data.aws_iam_policy.administrator-access: Read complete after 1s [id=arn:aws:iam::aws:policy/AdministratorAccess]
aws_iam_role_policy_attachment.ih-tf-terraform-control: Refreshing state... [id=ih-tf-terraform-control-20230630023317121000000001]
aws_iam_role_policy_attachment.aws-admin: Refreshing state... [id=aws-admin-20230322021121795000000001]
module.ih-tf-aws-control-990466748045-admin.data.aws_iam_policy.admin: Read complete after 1s [id=arn:aws:iam::aws:policy/AdministratorAccess]
module.ih-tf-aws-control-990466748045-admin.aws_iam_role_policy_attachment.admin: Refreshing state... [id=ih-tf-aws-control-admin-20230703024608473400000001]
aws_identitystore_group_membership.aleks["AWSControlTowerAdmins"]: Refreshing state... [id=d-916728b3e5/8949492e-9041-70b9-c921-e7abc7af7c5b]
aws_identitystore_group_membership.aleks["AWSSecurityAuditors"]: Refreshing state... [id=d-916728b3e5/6909999e-9001-70e5-a54e-b352bb1a32f8]
module.mediapc.aws_iam_user.backuper: Refreshing state... [id=twindb20230824154451928300000001]
module.mediapc.data.aws_iam_policy_document.backuper-permissions: Reading...
module.mediapc.data.aws_iam_policy_document.backuper-permissions: Read complete after 0s [id=2836020957]
module.mediapc.aws_iam_policy.backuper: Refreshing state... [id=arn:aws:iam::990466748045:policy/terraform-20230824154453948900000002]
module.mediapc.aws_iam_access_key.backuper: Refreshing state... [id=AKIA6NHDLF2G7AIXUYDG]
module.mediapc.aws_iam_user_policy_attachment.backuper: Refreshing state... [id=twindb20230824154451928300000001-20230824154454441300000003]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_glacier_vault.synology will be created
  + resource "aws_glacier_vault" "synology" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + location = (known after apply)
      + name     = "synology"
      + tags_all = (known after apply)
    }

  # aws_iam_access_key.synology will be created
  + resource "aws_iam_access_key" "synology" {
      + create_date                    = (known after apply)
      + encrypted_secret               = (known after apply)
      + encrypted_ses_smtp_password_v4 = (known after apply)
      + id                             = (known after apply)
      + key_fingerprint                = (known after apply)
      + secret                         = (sensitive value)
      + ses_smtp_password_v4           = (sensitive value)
      + status                         = "Active"
      + user                           = "synology"
    }

  # aws_iam_policy.synology will be created
  + resource "aws_iam_policy" "synology" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "sts:GetCallerIdentity"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_user.synology will be created
  + resource "aws_iam_user" "synology" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "synology"
      + path          = "/"
      + tags_all      = (known after apply)
      + unique_id     = (known after apply)
    }

  # aws_iam_user_policy_attachment.synology will be created
  + resource "aws_iam_user_policy_attachment" "synology" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + user       = "synology"
    }

Plan: 5 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
::debug::Terraform exited with code 0.
::debug::stdout: data.aws_iam_policy_document.ih-tf-terraform-control-assume: Reading...%0Adata.aws_iam_policy_document.synology-permissions: Reading...%0Adata.aws_iam_policy_document.synology-permissions: Read complete after 0s [id=1367345401]%0Adata.aws_iam_policy_document.ih-tf-terraform-control-assume: Read complete after 0s [id=1268673852]%0Amodule.ih-tf-aws-control-990466748045-admin.data.aws_iam_policy_document.github-permissions: Reading...%0Adata.aws_iam_policy_document.allow-assume: Reading...%0Aaws_iam_user.aleks: Refreshing state... [id=aleks]%0Amodule.github-connector.aws_iam_openid_connect_provider.github: Refreshing state... [id=arn:aws:iam::990466748045:oidc-provider/token.actions.githubusercontent.com]%0Aaws_iam_role.ih-tf-terraform-control: Refreshing state... [id=ih-tf-terraform-control]%0Adata.aws_ssoadmin_instances.sso: Reading...%0Amodule.ih-tf-aws-control-990466748045-admin.data.aws_iam_policy.admin: Reading...%0Adata.aws_iam_policy.administrator-access: Reading...%0Adata.aws_iam_policy_document.allow-assume: Read complete after 0s [id=2219106455]%0Amodule.mediapc.aws_s3_bucket.dst: Refreshing state... [id=twindb20230824154451928300000001]%0Amodule.ih-tf-aws-control-990466748045-admin.data.aws_iam_policy_document.github-permissions: Read complete after 0s [id=2054866892]%0Aaws_iam_policy.allow-assume: Refreshing state... [id=arn:aws:iam::990466748045:policy/allow-assume]%0Amodule.ih-tf-aws-control-990466748045-admin.aws_iam_policy.github: Refreshing state... [id=arn:aws:iam::990466748045:policy/ih-tf-aws-control-github]%0Aaws_iam_access_key.aleks: Refreshing state... [id=AKIA6NHDLF2G665VS5V2]%0Adata.aws_iam_policy_document.aws-admin: Reading...%0Adata.aws_iam_policy_document.aws-admin: Read complete after 0s [id=2092112735]%0Aaws_iam_role.aws-admin: Refreshing state... [id=aws-admin]%0Amodule.ih-tf-aws-control-990466748045-admin.data.aws_iam_policy_document.github-assume: Reading...%0Amodule.ih-tf-aws-control-990466748045-admin.data.aws_iam_policy_document.github-assume: Read complete after 0s [id=1250416815]%0Amodule.ih-tf-aws-control-990466748045-admin.aws_iam_role.github: Refreshing state... [id=ih-tf-aws-control-github]%0Aaws_iam_user_policy_attachment.aleks: Refreshing state... [id=aleks-20230630022352782000000001]%0Amodule.ih-tf-aws-control-990466748045-admin.aws_iam_role_policy_attachment.github: Refreshing state... [id=ih-tf-aws-control-github-20230824154108908400000001]%0Amodule.ih-tf-aws-control-990466748045-admin.data.aws_iam_policy_document.admin-assume: Reading...%0Amodule.ih-tf-aws-control-990466748045-admin.data.aws_iam_policy_document.admin-assume: Read complete after 0s [id=2670099516]%0Amodule.ih-tf-aws-control-990466748045-admin.aws_iam_role.admin: Refreshing state... [id=ih-tf-aws-control-admin]%0Adata.aws_ssoadmin_instances.sso: Read complete after 1s [id=us-west-1]%0Aaws_identitystore_user.aleks: Refreshing state... [id=d-916728b3e5/59a9295e-9021-702e-3f16-b9203b8d24cb]%0Aaws_identitystore_group.sso["AWSServiceCatalogAdmins"]: Refreshing state... [id=d-916728b3e5/a9a9595e-1051-70b4-b59e-c82d77841047]%0Aaws_identitystore_group.sso["AWSSecurityAuditors"]: Refreshing state... [id=d-916728b3e5/59f9497e-40a1-706f-2efa-43c3bd99fe12]%0Aaws_identitystore_group.sso["AWSSecurityAuditPowerUsers"]: Refreshing state... [id=d-916728b3e5/d969896e-6031-7076-4a7b-c8da8ce9f404]%0Aaws_identitystore_group.sso["AWSLogArchiveAdmins"]: Refreshing state... [id=d-916728b3e5/99e9691e-5081-7090-4fd7-fd5d80fe35f7]%0Aaws_identitystore_group.sso["AWSAccountFactory"]: Refreshing state... [id=d-916728b3e5/796959de-c011-7004-b753-de0a36ae352a]%0Aaws_identitystore_group.sso["AWSLogArchiveViewers"]: Refreshing state... [id=d-916728b3e5/e9a9399e-6081-70c1-f9d8-46f3143f9c5f]%0Aaws_identitystore_group.sso["AWSAuditAccountAdmins"]: Refreshing state... [id=d-916728b3e5/799999ee-e091-70a8-2c24-17f96ce95294]%0Aaws_identitystore_group.sso["AWSControlTowerAdmins"]: Refreshing state... [id=d-916728b3e5/f909599e-a011-70e6-4194-b9643e0b5439]%0Adata.aws_iam_policy.administrator-access: Read complete after 1s [id=arn:aws:iam::aws:policy/AdministratorAccess]%0Aaws_iam_role_policy_attachment.ih-tf-terraform-control: Refreshing state... [id=ih-tf-terraform-control-20230630023317121000000001]%0Aaws_iam_role_policy_attachment.aws-admin: Refreshing state... [id=aws-admin-20230322021121795000000001]%0Amodule.ih-tf-aws-control-990466748045-admin.data.aws_iam_policy.admin: Read complete after 1s [id=arn:aws:iam::aws:policy/AdministratorAccess]%0Amodule.ih-tf-aws-control-990466748045-admin.aws_iam_role_policy_attachment.admin: Refreshing state... [id=ih-tf-aws-control-admin-20230703024608473400000001]%0Aaws_identitystore_group_membership.aleks["AWSControlTowerAdmins"]: Refreshing state... [id=d-916728b3e5/8949492e-9041-70b9-c921-e7abc7af7c5b]%0Aaws_identitystore_group_membership.aleks["AWSSecurityAuditors"]: Refreshing state... [id=d-916728b3e5/6909999e-9001-70e5-a54e-b352bb1a32f8]%0Amodule.mediapc.aws_iam_user.backuper: Refreshing state... [id=twindb20230824154451928300000001]%0Amodule.mediapc.data.aws_iam_policy_document.backuper-permissions: Reading...%0Amodule.mediapc.data.aws_iam_policy_document.backuper-permissions: Read complete after 0s [id=2836020957]%0Amodule.mediapc.aws_iam_policy.backuper: Refreshing state... [id=arn:aws:iam::990466748045:policy/terraform-20230824154453948900000002]%0Amodule.mediapc.aws_iam_access_key.backuper: Refreshing state... [id=AKIA6NHDLF2G7AIXUYDG]%0Amodule.mediapc.aws_iam_user_policy_attachment.backuper: Refreshing state... [id=twindb20230824154451928300000001-20230824154454441300000003]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # aws_glacier_vault.synology will be created%0A  + resource "aws_glacier_vault" "synology" {%0A      + arn      = (known after apply)%0A      + id       = (known after apply)%0A      + location = (known after apply)%0A      + name     = "synology"%0A      + tags_all = (known after apply)%0A    }%0A%0A  # aws_iam_access_key.synology will be created%0A  + resource "aws_iam_access_key" "synology" {%0A      + create_date                    = (known after apply)%0A      + encrypted_secret               = (known after apply)%0A      + encrypted_ses_smtp_password_v4 = (known after apply)%0A      + id                             = (known after apply)%0A      + key_fingerprint                = (known after apply)%0A      + secret                         = (sensitive value)%0A      + ses_smtp_password_v4           = (sensitive value)%0A      + status                         = "Active"%0A      + user                           = "synology"%0A    }%0A%0A  # aws_iam_policy.synology will be created%0A  + resource "aws_iam_policy" "synology" {%0A      + arn              = (known after apply)%0A      + attachment_count = (known after apply)%0A      + id               = (known after apply)%0A      + name             = (known after apply)%0A      + name_prefix      = (known after apply)%0A      + path             = "/"%0A      + policy           = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action   = "sts:GetCallerIdentity"%0A                      + Effect   = "Allow"%0A                      + Resource = "*"%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + policy_id        = (known after apply)%0A      + tags_all         = (known after apply)%0A    }%0A%0A  # aws_iam_user.synology will be created%0A  + resource "aws_iam_user" "synology" {%0A      + arn           = (known after apply)%0A      + force_destroy = false%0A      + id            = (known after apply)%0A      + name          = "synology"%0A      + path          = "/"%0A      + tags_all      = (known after apply)%0A      + unique_id     = (known after apply)%0A    }%0A%0A  # aws_iam_user_policy_attachment.synology will be created%0A  + resource "aws_iam_user_policy_attachment" "synology" {%0A      + id         = (known after apply)%0A      + policy_arn = (known after apply)%0A      + user       = "synology"%0A    }%0A%0APlan: 5 to add, 0 to change, 0 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ASaved the plan to: tf.plan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "tf.plan"%0A
::debug::stderr: 
::debug::exitcode: 0
```
</details>
<details>
<summary>STDERR</summary>

```no output```
</details>
<details><summary><i>metadata</i></summary>
<p>
```eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgInN0ZG91dCI6ICJbY29tbWFuZF0vaG9tZS9ydW5uZXIvd29yay9fdGVtcC9jNjJlMDIxNC0yZDI3LTQwOTUtOWVkOC03ZDc2Y2E3ZGZmYTIvdGVycmFmb3JtLWJpbiBwbGFuIC1uby1jb2xvciAtdmFyLWZpbGU9Y29uZmlndXJhdGlvbi50ZnZhcnMgLS1vdXQ9dGYucGxhblxuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5paC10Zi10ZXJyYWZvcm0tY29udHJvbC1hc3N1bWU6IFJlYWRpbmcuLi5cbmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuc3lub2xvZ3ktcGVybWlzc2lvbnM6IFJlYWRpbmcuLi5cbmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuc3lub2xvZ3ktcGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTEzNjczNDU0MDFdXG5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmloLXRmLXRlcnJhZm9ybS1jb250cm9sLWFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MTI2ODY3Mzg1Ml1cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC05OTA0NjY3NDgwNDUtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naXRodWItcGVybWlzc2lvbnM6IFJlYWRpbmcuLi5cbmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYWxsb3ctYXNzdW1lOiBSZWFkaW5nLi4uXG5hd3NfaWFtX3VzZXIuYWxla3M6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFsZWtzXVxubW9kdWxlLmdpdGh1Yi1jb25uZWN0b3IuYXdzX2lhbV9vcGVuaWRfY29ubmVjdF9wcm92aWRlci5naXRodWI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjo5OTA0NjY3NDgwNDU6b2lkYy1wcm92aWRlci90b2tlbi5hY3Rpb25zLmdpdGh1YnVzZXJjb250ZW50LmNvbV1cbmF3c19pYW1fcm9sZS5paC10Zi10ZXJyYWZvcm0tY29udHJvbDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtdGVycmFmb3JtLWNvbnRyb2xdXG5kYXRhLmF3c19zc29hZG1pbl9pbnN0YW5jZXMuc3NvOiBSZWFkaW5nLi4uXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW46IFJlYWRpbmcuLi5cbmRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW5pc3RyYXRvci1hY2Nlc3M6IFJlYWRpbmcuLi5cbmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYWxsb3ctYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0yMjE5MTA2NDU1XVxubW9kdWxlLm1lZGlhcGMuYXdzX3MzX2J1Y2tldC5kc3Q6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXR3aW5kYjIwMjMwODI0MTU0NDUxOTI4MzAwMDAwMDAxXVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NS1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdpdGh1Yi1wZXJtaXNzaW9uczogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MjA1NDg2Njg5Ml1cbmF3c19pYW1fcG9saWN5LmFsbG93LWFzc3VtZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06Ojk5MDQ2Njc0ODA0NTpwb2xpY3kvYWxsb3ctYXNzdW1lXVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NS1hZG1pbi5hd3NfaWFtX3BvbGljeS5naXRodWI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjo5OTA0NjY3NDgwNDU6cG9saWN5L2loLXRmLWF3cy1jb250cm9sLWdpdGh1Yl1cbmF3c19pYW1fYWNjZXNzX2tleS5hbGVrczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9QUtJQTZOSERMRjJHNjY1VlM1VjJdXG5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmF3cy1hZG1pbjogUmVhZGluZy4uLlxuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hd3MtYWRtaW46IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTIwOTIxMTI3MzVdXG5hd3NfaWFtX3JvbGUuYXdzLWFkbWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hd3MtYWRtaW5dXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLWFzc3VtZTogUmVhZGluZy4uLlxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NS1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdpdGh1Yi1hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTEyNTA0MTY4MTVdXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1LWFkbWluLmF3c19pYW1fcm9sZS5naXRodWI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLWdpdGh1Yl1cbmF3c19pYW1fdXNlcl9wb2xpY3lfYXR0YWNobWVudC5hbGVrczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YWxla3MtMjAyMzA2MzAwMjIzNTI3ODIwMDAwMDAwMDFdXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1LWFkbWluLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5naXRodWI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLWdpdGh1Yi0yMDIzMDgyNDE1NDEwODkwODQwMDAwMDAwMV1cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC05OTA0NjY3NDgwNDUtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hZG1pbi1hc3N1bWU6IFJlYWRpbmcuLi5cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC05OTA0NjY3NDgwNDUtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hZG1pbi1hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTI2NzAwOTk1MTZdXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1LWFkbWluLmF3c19pYW1fcm9sZS5hZG1pbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtYXdzLWNvbnRyb2wtYWRtaW5dXG5kYXRhLmF3c19zc29hZG1pbl9pbnN0YW5jZXMuc3NvOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDFzIFtpZD11cy13ZXN0LTFdXG5hd3NfaWRlbnRpdHlzdG9yZV91c2VyLmFsZWtzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1kLTkxNjcyOGIzZTUvNTlhOTI5NWUtOTAyMS03MDJlLTNmMTYtYjkyMDNiOGQyNGNiXVxuYXdzX2lkZW50aXR5c3RvcmVfZ3JvdXAuc3NvW1wiQVdTU2VydmljZUNhdGFsb2dBZG1pbnNcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWQtOTE2NzI4YjNlNS9hOWE5NTk1ZS0xMDUxLTcwYjQtYjU5ZS1jODJkNzc4NDEwNDddXG5hd3NfaWRlbnRpdHlzdG9yZV9ncm91cC5zc29bXCJBV1NTZWN1cml0eUF1ZGl0b3JzXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1kLTkxNjcyOGIzZTUvNTlmOTQ5N2UtNDBhMS03MDZmLTJlZmEtNDNjM2JkOTlmZTEyXVxuYXdzX2lkZW50aXR5c3RvcmVfZ3JvdXAuc3NvW1wiQVdTU2VjdXJpdHlBdWRpdFBvd2VyVXNlcnNcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWQtOTE2NzI4YjNlNS9kOTY5ODk2ZS02MDMxLTcwNzYtNGE3Yi1jOGRhOGNlOWY0MDRdXG5hd3NfaWRlbnRpdHlzdG9yZV9ncm91cC5zc29bXCJBV1NMb2dBcmNoaXZlQWRtaW5zXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1kLTkxNjcyOGIzZTUvOTllOTY5MWUtNTA4MS03MDkwLTRmZDctZmQ1ZDgwZmUzNWY3XVxuYXdzX2lkZW50aXR5c3RvcmVfZ3JvdXAuc3NvW1wiQVdTQWNjb3VudEZhY3RvcnlcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWQtOTE2NzI4YjNlNS83OTY5NTlkZS1jMDExLTcwMDQtYjc1My1kZTBhMzZhZTM1MmFdXG5hd3NfaWRlbnRpdHlzdG9yZV9ncm91cC5zc29bXCJBV1NMb2dBcmNoaXZlVmlld2Vyc1wiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9ZC05MTY3MjhiM2U1L2U5YTkzOTllLTYwODEtNzBjMS1mOWQ4LTQ2ZjMxNDNmOWM1Zl1cbmF3c19pZGVudGl0eXN0b3JlX2dyb3VwLnNzb1tcIkFXU0F1ZGl0QWNjb3VudEFkbWluc1wiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9ZC05MTY3MjhiM2U1Lzc5OTk5OWVlLWUwOTEtNzBhOC0yYzI0LTE3Zjk2Y2U5NTI5NF1cbmF3c19pZGVudGl0eXN0b3JlX2dyb3VwLnNzb1tcIkFXU0NvbnRyb2xUb3dlckFkbWluc1wiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9ZC05MTY3MjhiM2U1L2Y5MDk1OTllLWEwMTEtNzBlNi00MTk0LWI5NjQzZTBiNTQzOV1cbmRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW5pc3RyYXRvci1hY2Nlc3M6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMXMgW2lkPWFybjphd3M6aWFtOjphd3M6cG9saWN5L0FkbWluaXN0cmF0b3JBY2Nlc3NdXG5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuaWgtdGYtdGVycmFmb3JtLWNvbnRyb2w6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLXRlcnJhZm9ybS1jb250cm9sLTIwMjMwNjMwMDIzMzE3MTIxMDAwMDAwMDAxXVxuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LmF3cy1hZG1pbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXdzLWFkbWluLTIwMjMwMzIyMDIxMTIxNzk1MDAwMDAwMDAxXVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NS1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5LmFkbWluOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDFzIFtpZD1hcm46YXdzOmlhbTo6YXdzOnBvbGljeS9BZG1pbmlzdHJhdG9yQWNjZXNzXVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NS1hZG1pbi5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuYWRtaW46IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLWFkbWluLTIwMjMwNzAzMDI0NjA4NDczNDAwMDAwMDAxXVxuYXdzX2lkZW50aXR5c3RvcmVfZ3JvdXBfbWVtYmVyc2hpcC5hbGVrc1tcIkFXU0NvbnRyb2xUb3dlckFkbWluc1wiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9ZC05MTY3MjhiM2U1Lzg5NDk0OTJlLTkwNDEtNzBiOS1jOTIxLWU3YWJjN2FmN2M1Yl1cbmF3c19pZGVudGl0eXN0b3JlX2dyb3VwX21lbWJlcnNoaXAuYWxla3NbXCJBV1NTZWN1cml0eUF1ZGl0b3JzXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1kLTkxNjcyOGIzZTUvNjkwOTk5OWUtOTAwMS03MGU1LWE1NGUtYjM1MmJiMWEzMmY4XVxubW9kdWxlLm1lZGlhcGMuYXdzX2lhbV91c2VyLmJhY2t1cGVyOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10d2luZGIyMDIzMDgyNDE1NDQ1MTkyODMwMDAwMDAwMV1cbm1vZHVsZS5tZWRpYXBjLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYmFja3VwZXItcGVybWlzc2lvbnM6IFJlYWRpbmcuLi5cbm1vZHVsZS5tZWRpYXBjLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYmFja3VwZXItcGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTI4MzYwMjA5NTddXG5tb2R1bGUubWVkaWFwYy5hd3NfaWFtX3BvbGljeS5iYWNrdXBlcjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06Ojk5MDQ2Njc0ODA0NTpwb2xpY3kvdGVycmFmb3JtLTIwMjMwODI0MTU0NDUzOTQ4OTAwMDAwMDAyXVxubW9kdWxlLm1lZGlhcGMuYXdzX2lhbV9hY2Nlc3Nfa2V5LmJhY2t1cGVyOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1BS0lBNk5IRExGMkc3QUlYVVlER11cbm1vZHVsZS5tZWRpYXBjLmF3c19pYW1fdXNlcl9wb2xpY3lfYXR0YWNobWVudC5iYWNrdXBlcjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dHdpbmRiMjAyMzA4MjQxNTQ0NTE5MjgzMDAwMDAwMDEtMjAyMzA4MjQxNTQ0NTQ0NDEzMDAwMDAwMDNdXG5cblRlcnJhZm9ybSB1c2VkIHRoZSBzZWxlY3RlZCBwcm92aWRlcnMgdG8gZ2VuZXJhdGUgdGhlIGZvbGxvd2luZyBleGVjdXRpb25cbnBsYW4uIFJlc291cmNlIGFjdGlvbnMgYXJlIGluZGljYXRlZCB3aXRoIHRoZSBmb2xsb3dpbmcgc3ltYm9sczpcbiAgKyBjcmVhdGVcblxuVGVycmFmb3JtIHdpbGwgcGVyZm9ybSB0aGUgZm9sbG93aW5nIGFjdGlvbnM6XG5cbiAgIyBhd3NfZ2xhY2llcl92YXVsdC5zeW5vbG9neSB3aWxsIGJlIGNyZWF0ZWRcbiAgKyByZXNvdXJjZSBcImF3c19nbGFjaWVyX3ZhdWx0XCIgXCJzeW5vbG9neVwiIHtcbiAgICAgICsgYXJuICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGlkICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBsb2NhdGlvbiA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgbmFtZSAgICAgPSBcInN5bm9sb2d5XCJcbiAgICAgICsgdGFnc19hbGwgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgfVxuXG4gICMgYXdzX2lhbV9hY2Nlc3Nfa2V5LnN5bm9sb2d5IHdpbGwgYmUgY3JlYXRlZFxuICArIHJlc291cmNlIFwiYXdzX2lhbV9hY2Nlc3Nfa2V5XCIgXCJzeW5vbG9neVwiIHtcbiAgICAgICsgY3JlYXRlX2RhdGUgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBlbmNyeXB0ZWRfc2VjcmV0ICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGVuY3J5cHRlZF9zZXNfc210cF9wYXNzd29yZF92NCA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgaWQgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBrZXlfZmluZ2VycHJpbnQgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHNlY3JldCAgICAgICAgICAgICAgICAgICAgICAgICA9IChzZW5zaXRpdmUgdmFsdWUpXG4gICAgICArIHNlc19zbXRwX3Bhc3N3b3JkX3Y0ICAgICAgICAgICA9IChzZW5zaXRpdmUgdmFsdWUpXG4gICAgICArIHN0YXR1cyAgICAgICAgICAgICAgICAgICAgICAgICA9IFwiQWN0aXZlXCJcbiAgICAgICsgdXNlciAgICAgICAgICAgICAgICAgICAgICAgICAgID0gXCJzeW5vbG9neVwiXG4gICAgfVxuXG4gICMgYXdzX2lhbV9wb2xpY3kuc3lub2xvZ3kgd2lsbCBiZSBjcmVhdGVkXG4gICsgcmVzb3VyY2UgXCJhd3NfaWFtX3BvbGljeVwiIFwic3lub2xvZ3lcIiB7XG4gICAgICArIGFybiAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGF0dGFjaG1lbnRfY291bnQgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGlkICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG5hbWUgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG5hbWVfcHJlZml4ICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHBhdGggICAgICAgICAgICAgPSBcIi9cIlxuICAgICAgKyBwb2xpY3kgICAgICAgICAgID0ganNvbmVuY29kZShcbiAgICAgICAgICAgIHtcbiAgICAgICAgICAgICAgKyBTdGF0ZW1lbnQgPSBbXG4gICAgICAgICAgICAgICAgICArIHtcbiAgICAgICAgICAgICAgICAgICAgICArIEFjdGlvbiAgID0gXCJzdHM6R2V0Q2FsbGVySWRlbnRpdHlcIlxuICAgICAgICAgICAgICAgICAgICAgICsgRWZmZWN0ICAgPSBcIkFsbG93XCJcbiAgICAgICAgICAgICAgICAgICAgICArIFJlc291cmNlID0gXCIqXCJcbiAgICAgICAgICAgICAgICAgICAgfSxcbiAgICAgICAgICAgICAgICBdXG4gICAgICAgICAgICAgICsgVmVyc2lvbiAgID0gXCIyMDEyLTEwLTE3XCJcbiAgICAgICAgICAgIH1cbiAgICAgICAgKVxuICAgICAgKyBwb2xpY3lfaWQgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyB0YWdzX2FsbCAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgIH1cblxuICAjIGF3c19pYW1fdXNlci5zeW5vbG9neSB3aWxsIGJlIGNyZWF0ZWRcbiAgKyByZXNvdXJjZSBcImF3c19pYW1fdXNlclwiIFwic3lub2xvZ3lcIiB7XG4gICAgICArIGFybiAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGZvcmNlX2Rlc3Ryb3kgPSBmYWxzZVxuICAgICAgKyBpZCAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBuYW1lICAgICAgICAgID0gXCJzeW5vbG9neVwiXG4gICAgICArIHBhdGggICAgICAgICAgPSBcIi9cIlxuICAgICAgKyB0YWdzX2FsbCAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyB1bmlxdWVfaWQgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgIH1cblxuICAjIGF3c19pYW1fdXNlcl9wb2xpY3lfYXR0YWNobWVudC5zeW5vbG9neSB3aWxsIGJlIGNyZWF0ZWRcbiAgKyByZXNvdXJjZSBcImF3c19pYW1fdXNlcl9wb2xpY3lfYXR0YWNobWVudFwiIFwic3lub2xvZ3lcIiB7XG4gICAgICArIGlkICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHBvbGljeV9hcm4gPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHVzZXIgICAgICAgPSBcInN5bm9sb2d5XCJcbiAgICB9XG5cblBsYW46IDUgdG8gYWRkLCAwIHRvIGNoYW5nZSwgMCB0byBkZXN0cm95LlxuXG5cdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcblxuU2F2ZWQgdGhlIHBsYW4gdG86IHRmLnBsYW5cblxuVG8gcGVyZm9ybSBleGFjdGx5IHRoZXNlIGFjdGlvbnMsIHJ1biB0aGUgZm9sbG93aW5nIGNvbW1hbmQgdG8gYXBwbHk6XG4gICAgdGVycmFmb3JtIGFwcGx5IFwidGYucGxhblwiXG46OmRlYnVnOjpUZXJyYWZvcm0gZXhpdGVkIHdpdGggY29kZSAwLlxuOjpkZWJ1Zzo6c3Rkb3V0OiBkYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmloLXRmLXRlcnJhZm9ybS1jb250cm9sLWFzc3VtZTogUmVhZGluZy4uLiUwQWRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuc3lub2xvZ3ktcGVybWlzc2lvbnM6IFJlYWRpbmcuLi4lMEFkYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnN5bm9sb2d5LXBlcm1pc3Npb25zOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0xMzY3MzQ1NDAxXSUwQWRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuaWgtdGYtdGVycmFmb3JtLWNvbnRyb2wtYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0xMjY4NjczODUyXSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC05OTA0NjY3NDgwNDUtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naXRodWItcGVybWlzc2lvbnM6IFJlYWRpbmcuLi4lMEFkYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFsbG93LWFzc3VtZTogUmVhZGluZy4uLiUwQWF3c19pYW1fdXNlci5hbGVrczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YWxla3NdJTBBbW9kdWxlLmdpdGh1Yi1jb25uZWN0b3IuYXdzX2lhbV9vcGVuaWRfY29ubmVjdF9wcm92aWRlci5naXRodWI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjo5OTA0NjY3NDgwNDU6b2lkYy1wcm92aWRlci90b2tlbi5hY3Rpb25zLmdpdGh1YnVzZXJjb250ZW50LmNvbV0lMEFhd3NfaWFtX3JvbGUuaWgtdGYtdGVycmFmb3JtLWNvbnRyb2w6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLXRlcnJhZm9ybS1jb250cm9sXSUwQWRhdGEuYXdzX3Nzb2FkbWluX2luc3RhbmNlcy5zc286IFJlYWRpbmcuLi4lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW46IFJlYWRpbmcuLi4lMEFkYXRhLmF3c19pYW1fcG9saWN5LmFkbWluaXN0cmF0b3ItYWNjZXNzOiBSZWFkaW5nLi4uJTBBZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hbGxvdy1hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTIyMTkxMDY0NTVdJTBBbW9kdWxlLm1lZGlhcGMuYXdzX3MzX2J1Y2tldC5kc3Q6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXR3aW5kYjIwMjMwODI0MTU0NDUxOTI4MzAwMDAwMDAxXSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC05OTA0NjY3NDgwNDUtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naXRodWItcGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTIwNTQ4NjY4OTJdJTBBYXdzX2lhbV9wb2xpY3kuYWxsb3ctYXNzdW1lOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6OTkwNDY2NzQ4MDQ1OnBvbGljeS9hbGxvdy1hc3N1bWVdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NS1hZG1pbi5hd3NfaWFtX3BvbGljeS5naXRodWI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjo5OTA0NjY3NDgwNDU6cG9saWN5L2loLXRmLWF3cy1jb250cm9sLWdpdGh1Yl0lMEFhd3NfaWFtX2FjY2Vzc19rZXkuYWxla3M6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPUFLSUE2TkhETEYyRzY2NVZTNVYyXSUwQWRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYXdzLWFkbWluOiBSZWFkaW5nLi4uJTBBZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hd3MtYWRtaW46IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTIwOTIxMTI3MzVdJTBBYXdzX2lhbV9yb2xlLmF3cy1hZG1pbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXdzLWFkbWluXSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC05OTA0NjY3NDgwNDUtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naXRodWItYXNzdW1lOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NS1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdpdGh1Yi1hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTEyNTA0MTY4MTVdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NS1hZG1pbi5hd3NfaWFtX3JvbGUuZ2l0aHViOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC1naXRodWJdJTBBYXdzX2lhbV91c2VyX3BvbGljeV9hdHRhY2htZW50LmFsZWtzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hbGVrcy0yMDIzMDYzMDAyMjM1Mjc4MjAwMDAwMDAwMV0lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1LWFkbWluLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5naXRodWI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLWdpdGh1Yi0yMDIzMDgyNDE1NDEwODkwODQwMDAwMDAwMV0lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYWRtaW4tYXNzdW1lOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NS1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFkbWluLWFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MjY3MDA5OTUxNl0lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1LWFkbWluLmF3c19pYW1fcm9sZS5hZG1pbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtYXdzLWNvbnRyb2wtYWRtaW5dJTBBZGF0YS5hd3Nfc3NvYWRtaW5faW5zdGFuY2VzLnNzbzogUmVhZCBjb21wbGV0ZSBhZnRlciAxcyBbaWQ9dXMtd2VzdC0xXSUwQWF3c19pZGVudGl0eXN0b3JlX3VzZXIuYWxla3M6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWQtOTE2NzI4YjNlNS81OWE5Mjk1ZS05MDIxLTcwMmUtM2YxNi1iOTIwM2I4ZDI0Y2JdJTBBYXdzX2lkZW50aXR5c3RvcmVfZ3JvdXAuc3NvW1wiQVdTU2VydmljZUNhdGFsb2dBZG1pbnNcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWQtOTE2NzI4YjNlNS9hOWE5NTk1ZS0xMDUxLTcwYjQtYjU5ZS1jODJkNzc4NDEwNDddJTBBYXdzX2lkZW50aXR5c3RvcmVfZ3JvdXAuc3NvW1wiQVdTU2VjdXJpdHlBdWRpdG9yc1wiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9ZC05MTY3MjhiM2U1LzU5Zjk0OTdlLTQwYTEtNzA2Zi0yZWZhLTQzYzNiZDk5ZmUxMl0lMEFhd3NfaWRlbnRpdHlzdG9yZV9ncm91cC5zc29bXCJBV1NTZWN1cml0eUF1ZGl0UG93ZXJVc2Vyc1wiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9ZC05MTY3MjhiM2U1L2Q5Njk4OTZlLTYwMzEtNzA3Ni00YTdiLWM4ZGE4Y2U5ZjQwNF0lMEFhd3NfaWRlbnRpdHlzdG9yZV9ncm91cC5zc29bXCJBV1NMb2dBcmNoaXZlQWRtaW5zXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1kLTkxNjcyOGIzZTUvOTllOTY5MWUtNTA4MS03MDkwLTRmZDctZmQ1ZDgwZmUzNWY3XSUwQWF3c19pZGVudGl0eXN0b3JlX2dyb3VwLnNzb1tcIkFXU0FjY291bnRGYWN0b3J5XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1kLTkxNjcyOGIzZTUvNzk2OTU5ZGUtYzAxMS03MDA0LWI3NTMtZGUwYTM2YWUzNTJhXSUwQWF3c19pZGVudGl0eXN0b3JlX2dyb3VwLnNzb1tcIkFXU0xvZ0FyY2hpdmVWaWV3ZXJzXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1kLTkxNjcyOGIzZTUvZTlhOTM5OWUtNjA4MS03MGMxLWY5ZDgtNDZmMzE0M2Y5YzVmXSUwQWF3c19pZGVudGl0eXN0b3JlX2dyb3VwLnNzb1tcIkFXU0F1ZGl0QWNjb3VudEFkbWluc1wiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9ZC05MTY3MjhiM2U1Lzc5OTk5OWVlLWUwOTEtNzBhOC0yYzI0LTE3Zjk2Y2U5NTI5NF0lMEFhd3NfaWRlbnRpdHlzdG9yZV9ncm91cC5zc29bXCJBV1NDb250cm9sVG93ZXJBZG1pbnNcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWQtOTE2NzI4YjNlNS9mOTA5NTk5ZS1hMDExLTcwZTYtNDE5NC1iOTY0M2UwYjU0MzldJTBBZGF0YS5hd3NfaWFtX3BvbGljeS5hZG1pbmlzdHJhdG9yLWFjY2VzczogUmVhZCBjb21wbGV0ZSBhZnRlciAxcyBbaWQ9YXJuOmF3czppYW06OmF3czpwb2xpY3kvQWRtaW5pc3RyYXRvckFjY2Vzc10lMEFhd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuaWgtdGYtdGVycmFmb3JtLWNvbnRyb2w6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLXRlcnJhZm9ybS1jb250cm9sLTIwMjMwNjMwMDIzMzE3MTIxMDAwMDAwMDAxXSUwQWF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5hd3MtYWRtaW46IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWF3cy1hZG1pbi0yMDIzMDMyMjAyMTEyMTc5NTAwMDAwMDAwMV0lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW46IFJlYWQgY29tcGxldGUgYWZ0ZXIgMXMgW2lkPWFybjphd3M6aWFtOjphd3M6cG9saWN5L0FkbWluaXN0cmF0b3JBY2Nlc3NdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NS1hZG1pbi5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuYWRtaW46IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLWFkbWluLTIwMjMwNzAzMDI0NjA4NDczNDAwMDAwMDAxXSUwQWF3c19pZGVudGl0eXN0b3JlX2dyb3VwX21lbWJlcnNoaXAuYWxla3NbXCJBV1NDb250cm9sVG93ZXJBZG1pbnNcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWQtOTE2NzI4YjNlNS84OTQ5NDkyZS05MDQxLTcwYjktYzkyMS1lN2FiYzdhZjdjNWJdJTBBYXdzX2lkZW50aXR5c3RvcmVfZ3JvdXBfbWVtYmVyc2hpcC5hbGVrc1tcIkFXU1NlY3VyaXR5QXVkaXRvcnNcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWQtOTE2NzI4YjNlNS82OTA5OTk5ZS05MDAxLTcwZTUtYTU0ZS1iMzUyYmIxYTMyZjhdJTBBbW9kdWxlLm1lZGlhcGMuYXdzX2lhbV91c2VyLmJhY2t1cGVyOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10d2luZGIyMDIzMDgyNDE1NDQ1MTkyODMwMDAwMDAwMV0lMEFtb2R1bGUubWVkaWFwYy5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmJhY2t1cGVyLXBlcm1pc3Npb25zOiBSZWFkaW5nLi4uJTBBbW9kdWxlLm1lZGlhcGMuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5iYWNrdXBlci1wZXJtaXNzaW9uczogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MjgzNjAyMDk1N10lMEFtb2R1bGUubWVkaWFwYy5hd3NfaWFtX3BvbGljeS5iYWNrdXBlcjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06Ojk5MDQ2Njc0ODA0NTpwb2xpY3kvdGVycmFmb3JtLTIwMjMwODI0MTU0NDUzOTQ4OTAwMDAwMDAyXSUwQW1vZHVsZS5tZWRpYXBjLmF3c19pYW1fYWNjZXNzX2tleS5iYWNrdXBlcjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9QUtJQTZOSERMRjJHN0FJWFVZREddJTBBbW9kdWxlLm1lZGlhcGMuYXdzX2lhbV91c2VyX3BvbGljeV9hdHRhY2htZW50LmJhY2t1cGVyOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10d2luZGIyMDIzMDgyNDE1NDQ1MTkyODMwMDAwMDAwMS0yMDIzMDgyNDE1NDQ1NDQ0MTMwMDAwMDAwM10lMEElMEFUZXJyYWZvcm0gdXNlZCB0aGUgc2VsZWN0ZWQgcHJvdmlkZXJzIHRvIGdlbmVyYXRlIHRoZSBmb2xsb3dpbmcgZXhlY3V0aW9uJTBBcGxhbi4gUmVzb3VyY2UgYWN0aW9ucyBhcmUgaW5kaWNhdGVkIHdpdGggdGhlIGZvbGxvd2luZyBzeW1ib2xzOiUwQSAgKyBjcmVhdGUlMEElMEFUZXJyYWZvcm0gd2lsbCBwZXJmb3JtIHRoZSBmb2xsb3dpbmcgYWN0aW9uczolMEElMEEgICMgYXdzX2dsYWNpZXJfdmF1bHQuc3lub2xvZ3kgd2lsbCBiZSBjcmVhdGVkJTBBICArIHJlc291cmNlIFwiYXdzX2dsYWNpZXJfdmF1bHRcIiBcInN5bm9sb2d5XCIgeyUwQSAgICAgICsgYXJuICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBpZCAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGxvY2F0aW9uID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgbmFtZSAgICAgPSBcInN5bm9sb2d5XCIlMEEgICAgICArIHRhZ3NfYWxsID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICB9JTBBJTBBICAjIGF3c19pYW1fYWNjZXNzX2tleS5zeW5vbG9neSB3aWxsIGJlIGNyZWF0ZWQlMEEgICsgcmVzb3VyY2UgXCJhd3NfaWFtX2FjY2Vzc19rZXlcIiBcInN5bm9sb2d5XCIgeyUwQSAgICAgICsgY3JlYXRlX2RhdGUgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgZW5jcnlwdGVkX3NlY3JldCAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgZW5jcnlwdGVkX3Nlc19zbXRwX3Bhc3N3b3JkX3Y0ID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgaWQgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsga2V5X2ZpbmdlcnByaW50ICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgc2VjcmV0ICAgICAgICAgICAgICAgICAgICAgICAgID0gKHNlbnNpdGl2ZSB2YWx1ZSklMEEgICAgICArIHNlc19zbXRwX3Bhc3N3b3JkX3Y0ICAgICAgICAgICA9IChzZW5zaXRpdmUgdmFsdWUpJTBBICAgICAgKyBzdGF0dXMgICAgICAgICAgICAgICAgICAgICAgICAgPSBcIkFjdGl2ZVwiJTBBICAgICAgKyB1c2VyICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcInN5bm9sb2d5XCIlMEEgICAgfSUwQSUwQSAgIyBhd3NfaWFtX3BvbGljeS5zeW5vbG9neSB3aWxsIGJlIGNyZWF0ZWQlMEEgICsgcmVzb3VyY2UgXCJhd3NfaWFtX3BvbGljeVwiIFwic3lub2xvZ3lcIiB7JTBBICAgICAgKyBhcm4gICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgYXR0YWNobWVudF9jb3VudCA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGlkICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBuYW1lICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgbmFtZV9wcmVmaXggICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHBhdGggICAgICAgICAgICAgPSBcIi9cIiUwQSAgICAgICsgcG9saWN5ICAgICAgICAgICA9IGpzb25lbmNvZGUoJTBBICAgICAgICAgICAgeyUwQSAgICAgICAgICAgICAgKyBTdGF0ZW1lbnQgPSBbJTBBICAgICAgICAgICAgICAgICAgKyB7JTBBICAgICAgICAgICAgICAgICAgICAgICsgQWN0aW9uICAgPSBcInN0czpHZXRDYWxsZXJJZGVudGl0eVwiJTBBICAgICAgICAgICAgICAgICAgICAgICsgRWZmZWN0ICAgPSBcIkFsbG93XCIlMEEgICAgICAgICAgICAgICAgICAgICAgKyBSZXNvdXJjZSA9IFwiKlwiJTBBICAgICAgICAgICAgICAgICAgICB9LCUwQSAgICAgICAgICAgICAgICBdJTBBICAgICAgICAgICAgICArIFZlcnNpb24gICA9IFwiMjAxMi0xMC0xN1wiJTBBICAgICAgICAgICAgfSUwQSAgICAgICAgKSUwQSAgICAgICsgcG9saWN5X2lkICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHRhZ3NfYWxsICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgIH0lMEElMEEgICMgYXdzX2lhbV91c2VyLnN5bm9sb2d5IHdpbGwgYmUgY3JlYXRlZCUwQSAgKyByZXNvdXJjZSBcImF3c19pYW1fdXNlclwiIFwic3lub2xvZ3lcIiB7JTBBICAgICAgKyBhcm4gICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgZm9yY2VfZGVzdHJveSA9IGZhbHNlJTBBICAgICAgKyBpZCAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgbmFtZSAgICAgICAgICA9IFwic3lub2xvZ3lcIiUwQSAgICAgICsgcGF0aCAgICAgICAgICA9IFwiL1wiJTBBICAgICAgKyB0YWdzX2FsbCAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgdW5pcXVlX2lkICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgfSUwQSUwQSAgIyBhd3NfaWFtX3VzZXJfcG9saWN5X2F0dGFjaG1lbnQuc3lub2xvZ3kgd2lsbCBiZSBjcmVhdGVkJTBBICArIHJlc291cmNlIFwiYXdzX2lhbV91c2VyX3BvbGljeV9hdHRhY2htZW50XCIgXCJzeW5vbG9neVwiIHslMEEgICAgICArIGlkICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBwb2xpY3lfYXJuID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgdXNlciAgICAgICA9IFwic3lub2xvZ3lcIiUwQSAgICB9JTBBJTBBUGxhbjogNSB0byBhZGQsIDAgdG8gY2hhbmdlLCAwIHRvIGRlc3Ryb3kuJTBBJTBBXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwJTBBJTBBU2F2ZWQgdGhlIHBsYW4gdG86IHRmLnBsYW4lMEElMEFUbyBwZXJmb3JtIGV4YWN0bHkgdGhlc2UgYWN0aW9ucywgcnVuIHRoZSBmb2xsb3dpbmcgY29tbWFuZCB0byBhcHBseTolMEEgICAgdGVycmFmb3JtIGFwcGx5IFwidGYucGxhblwiJTBBXG46OmRlYnVnOjpzdGRlcnI6IFxuOjpkZWJ1Zzo6ZXhpdGNvZGU6IDBcbiIsICJzdGRlcnIiOiAiIiwgImFkZCI6IDUsICJjaGFuZ2UiOiAwLCAiZGVzdHJveSI6IDB9fQ==```
</p></details>